[
  {
    "title": "Two killed as three buses collide on Dhaka–Sylhet highway",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture Two killed as three buses collide on Dhaka–Sylhet highway Long traffic jam formed on the highway following the accident 17 January 2026, 11:49 AM UPDATED\n\t\t\t\t\t\t17 January 2026, 11:49 AM NEWS SHARE By Our Correspondent, Sylhet Photo: Collected Two people were killed in a road accident involving three buses on the Dhaka–Sylhet highway in Osmaninagar upazila of Sylhet early today. The identities of the deceased could not be confirmed immediately. However, eyewitnesses said both victims were the driver and helper of a Shyamoli Paribahan bus, Osmaninagar Police Station Officer-in-Charge Md Morshedul Hasan Bhuiyan told The Daily Star. For all latest news, follow The Daily Star's Google News channel. Quoting witnesses, the OC said the accident occurred around 6:30am on the highway in Dayamir area when a high-speed Ena Paribahan bus coming from Dhaka collided head-on with a Shyamoli Paribahan bus heading towards Sylhet in front of Dayamir Madrasa. Another bus following the Ena Paribahan vehicle was also involved in the crash. The front portions of the Ena and Shyamoli buses were badly damaged, leaving the Shyamoli Paribahan's bus driver and helper dead on the spot. At least 10 passengers were injured, the OC said. On information, teams from Tajpur Fire Service, local police and highway police rushed to the scene, rescued the injured and sent them to Sylhet MAG Osmani Medical College Hospital. Following the accident, a long traffic jam formed on the highway. As of filing this report, vehicles were stranded for several kilometres on both sides of the road, while police were working to restore traffic movement. SHARE Click to comment Comments Comments Policy",
    "url": "https://www.thedailystar.net/news/bangladesh/accidents-fires/news/two-killed-three-buses-collide-dhaka-sylhet-highway-4082951",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "Andrew Tate defeated by kickboxer in ‘pink gloves’",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture Andrew Tate defeated by kickboxer in ‘pink gloves’ 21 December 2025, 13:10 PM UPDATED\n\t\t\t\t\t\t21 December 2025, 21:32 PM ENTERTAINMENT SHARE By Arts & Entertainment Desk Photo: Collected Former kickboxing champion and controversial internet figure Andrew Tate was defeated by reality-TV personality Chase DeMoor at Misfits Mania: The Fight Before Christmas. Tate was left injured, bloodied and visibly bruised after enduring a punishing defeat in his controversial return to the ring. He reportedly suffered a severe eye injury. For all latest news, follow The Daily Star's Google News channel. While mainstream coverage focused on the unexpected outcome, social media buzz took a lighter cultural turn, centring on the striking imagery of DeMoor fighting in bright pink gloves. Clips and memes circulated showing Tate taking heavy shots and even going to his knees against an opponent wearing pink gloves — a detail that has become a symbolic punchline in online reactions. Many users joked about the irony of Tate, known for projecting hyper-masculine ideas, being bested by someone wearing a colour traditionally associated with femininity, turning the gloves into a humorous cultural marker. On Reddit, users riffed on the pink gloves theme with comments such as \"got whooped by some pink gloves — not alpha\" and \"chased by the pink,\" blending humour with criticism of Tate's macho persona. Read more Warfaze postpones 'Forty Years Legacy Concert Tour' Others highlighted the bout's spectacle over sporting quality, lampooning the level of boxing and the influencer-style showdown. Some commentators also mocked Tate's post-fight message and his televised persona. While the glove colour carries no official sporting significance, it has added a viral cultural twist to the narrative of an unlikely defeat. ANDREW TATE BOXING LOSS ANDREW TATE CHASE DEMOOR FIGHT ANDREW TATE HYPER MASCULINITY DEBATE SHARE Click to comment Comments Comments Policy Related News Andrew Tate defeated by kickboxer in ‘pink gloves’ 21 December 2025, 13:10 PM Entertainment",
    "url": "https://www.thedailystar.net/entertainment/news/andrew-tate-defeated-kickboxer-pink-gloves-4063331",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "Govt merges two health ministry divisions for better coordination",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture Govt merges two health ministry divisions for better coordination Nicar approves unification of Health Services and Medical Education and Family Welfare divisions 20 January 2026, 20:50 PM UPDATED\n\t\t\t\t\t\t20 January 2026, 20:50 PM NEWS SHARE By Star Online Report The government today merged the two divisions of the health ministry to ensure better coordination and improved medical services for the people. They are the Health Services Division and the Medical Education and Family Welfare Division. For all latest news, follow The Daily Star's Google News channel. The National Implementation Committee on Administrative Reorganisation (Nicar), with Chief Adviser Prof Muhammad Yunus in the chair, approved a proposal in this regard today. Earlier, the pre-Nicar, in its meeting on October 29 last year, recommended merging the two divisions. The pre-Nicar, headed by the cabinet secretary, scrutinises proposals for forming new ministries, city corporations, municipalities, divisions, districts and upazilas, and for approving manpower. It provides recommendations on these matters to Nicar, which is headed by the chief adviser. In March 2017, the government split the Health and Family Welfare Ministry into two separate divisions to improve health services management. Various departments were reorganised and placed under the two divisions, each headed by a secretary. However, the split did not bring the expected benefits; rather, the quality of both divisions deteriorated, according to the minutes of the pre-Nicar meeting. As a result, the committee recommended merging the divisions to restore pace and coordination. In September last year, the Cabinet Division issued a gazette merging the two divisions -- the Public Security Division and the Security Services Division -- of the home ministry. SHARE Click to comment Comments Comments Policy",
    "url": "https://www.thedailystar.net/news/bangladesh/governance/news/govt-merges-two-health-ministry-divisions-better-coordination-4086001",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "Fakhrul condemns Chuadanga BNP leader’s death in custody, demands justice",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture Fakhrul condemns Chuadanga BNP leader’s death in custody, demands justice Calls for army intervention and fair probe, terming the killing ‘unacceptable’ 13 January 2026, 16:17 PM UPDATED\n\t\t\t\t\t\t13 January 2026, 16:17 PM BANGLADESH SHARE By Star Online Report BNP Secretary General Mirza Fakhrul Islam Alamgir today strongly condemned the death of Shamsuzzaman Dablu, general secretary of BNP Jibannagar municipal unit of Chuadanga, in custody. In a condolence statement, Fakhrul urged the army chief to intervene and demanded justice for the slain BNP leader through a fair and impartial investigation. For all latest news, follow The Daily Star's Google News channel. Fakhrul said, \"Last night, Shamsuzzaman was picked up by some members of the law enforcement agencies in the name of recovering firearms and subjected to inhuman torture, resulting in his death.\" He said, “We believe that incidents of this kind carried out by members of the law enforcement agencies are not good for the country. The killing of Shamsuzzaman through torture in an extrajudicial manner is a gross violation of the country’s prevailing laws.” Fakhrul said, during the tenure of the present interim government, exemplary punishment for any crime must be ensured through speedy trial—this is the expectation of the people. “But the killing of Shamsuzzaman Dablu through inhuman torture after he was picked up in the name of recovering arms by members of law enforcement agencies is in no way acceptable to the people of the country.” SHARE Click to comment Comments Comments Policy",
    "url": "https://www.thedailystar.net/news/fakhrul-condemns-chuadanga-bnp-leaders-death-custody-demands-justice-4079986",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "Banks asked to settle inward remittances in a day",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture Banks asked to settle inward remittances in a day 8 January 2026, 11:03 AM UPDATED\n\t\t\t\t\t\t10 January 2026, 05:26 AM BUSINESS SHARE By Star Business Report Bangladesh Bank (BB) has instructed banks to credit inward remittances to beneficiaries' accounts on the same day or the next business day in order to reduce delays and improve efficiency in cross-border payment processing. The central bank issued a circular in this regard today, which takes immediate effect. However, banks have been given a transition period until March 31, 2026, to fully comply with the new instructions. For all latest news, follow The Daily Star's Google News channel. Under the circular, banks must promptly notify customers through secure electronic channels once an inward remittance message is received. Remittances received during banking hours must be credited on the same business day, while those received after banking hours must be credited on the next business day. Read more Highest ever remittance came in 2025 To speed up processing, banks have been advised to adopt straight-through processing (STP) or risk-based expedited processing methods. Where essential information is available, beneficiary accounts may be credited even if some documentation or compliance checks are pending, with the remaining requirements to be completed afterwards, according to the circular. If post-credit review is not feasible, banks will be required to complete pre-credit verification and settle the transactions within three business days. The banking regulator has also directed banks to reduce reliance on end-of-day nostro account statements and instead use intraday credit confirmations to accelerate settlement. Banks have been encouraged to strengthen their reconciliation systems, with reconciliation intervals generally not exceeding 60 minutes. The circular further stressed the importance of payment tracking and transparency, instructing banks to use the Unique End-to-End Transaction Reference to trace inward remittances from receipt to final credit BANGLADESH BANK REMITTANCES SHARE Click to comment Comments Comments Policy Related News Financial inclusion in rural areas improves: BB 18 January 2026, 00:00 AM Referendum campaign creates unease among some bankers 14 January 2026, 00:00 AM Business BB aims to cut bad loans to 25% by March 12 January 2026, 00:00 AM Banks asked to settle inward remittances in a day 8 January 2026, 11:03 AM Business Banks asked to ensure women-friendly washrooms across all branches 6 January 2026, 15:13 PM Banking",
    "url": "https://www.thedailystar.net/business/news/banks-asked-settle-inward-remittances-day-4076256",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "How will artificial intelligence transform the labour market?",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture How will artificial intelligence transform the labour market? 21 January 2026, 23:28 PM UPDATED\n\t\t\t\t\t\t22 January 2026, 16:07 PM SUPPLEMENTS SHARE By Muhammad Shafiullah Photo: Prabir Das Artificial Intelligence (AI) is expected to pose the biggest disruption to global labour markets since the industrial revolution in the 19th century. The speed and scope of this unprecedented disruption will not be felt equally across industries, and nations. Bangladesh, a developing economy, will likely undergo a unique labour market transformation. Bangladesh’s job market remains largely informal, routine-task dominated, and credential-biased—rendering workers particularly susceptible to AI-powered automation. This poses a seemingly insurmountable risk for the two million Bangladeshis entering the labour market annually, including more than six lakh university graduates. Contemporary AI and robotic technologies are unable to undertake dextrous work rendering tenuous respite to vocational and technical jobs. The skills mismatch between Bangladesh’s education system and labour market is widely highlighted in the nation’s public discourse. The rote-based education system prepares students for general repetitive tasks (Figure 1)—i.e., garments production line or customer service. AI and robotics can easily replace, and perhaps supersede, humans in these tasks. Bangladesh’s labour force is largely unprepared for complex and creative tasks in emerging professions at home and abroad. This has culminated in grade- and credential-inflated Bangladeshi ‘white-collar’ workers who remain inadequately prepared for many in-demand skills such as creative and professional content creation, design, data analysis, computer programming, AI prompt writing, inter alia. For all latest news, follow The Daily Star's Google News channel. Vocational and technical training may also help the aspirant migrant workers land overseas roles that are managerial, more secure, and well-paid. Photo: Prabir Das Bangladesh’s labour is overwhelmingly informal (Figure 2)—with impromptu, uncompetitive hiring/firing and no employer involvement in workers’ skill development.Employees and employersplace their trust on blind loyalty instead of upskilling and re-skilling.This creates a perplexing scenario where entry-level jobs erode due to automation and postponed hiring while firing remains minimal. This phenomenon, however, is prevalent not only in Bangladeshbut alsoacross much of the developed world. The ‘informality’ of Bangladeshi jobs makes workers more vulnerable, as employers may replace them for intermittent AI service subscriptions. Moreover, inequality is expected to worsen since entry- and mid-level roles, especially informal ones, are ‘hollowed out’ by AI. The solution to this doomsday scenario is a structural transformation of how we educate our workers. Instead of banning AI from classrooms, students need to learn to use AI to their advantage. AI can help our students improve and develop their creativity, data analysis, and programming skills.In class, I often present the following perhaps overly optimistic and simplistic outlook for an AI-powered future: Imagine a 2050 Facebook entrepreneur selling designer clothes—popularly known as ‘api’s’ or ‘sisters.’ During a live stream, she takes an order, designs a unique dress, and manufactures it in real time using AI prompt-writing and 3D printing, and delivers it within hours via AI-powered autonomous drones. Such a scenario may not be far-fetched, as similar job roles and AI functionalities exist under current technologies. The key is to train these ‘api’s’ and create an enabling environment for AI to complement her creativity. To date, Bangladesh’s policymakers, industry leaders, and educators placed limited emphasis on envisioning or planning for such a fully integrated future. Contrary to this doom and gloom, professions requiring vocational or technical skills appear relatively resilient to AI takeover for now. This is because contemporary AI systems are often centred around large language models which are suited to replacing desk-based routine tasks. In contrast, the latest automation and robotic technologies lack dexterity and adaptability needed to undertake non-routine manual work such as automobile repair, construction, cooking, and plumbing. These jobs also require on-premises diagnosis and problem-solving, decision-making, experience and intuition, and human interactions. AI-powered automation may perform some individual tasks m",
    "url": "https://www.thedailystar.net/news/how-will-artificial-intelligence-transform-the-labour-market-4087106",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "Emotional Sabalenka comes through test to make last 16 at Australian Open",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture Emotional Sabalenka comes through test to make last 16 at Australian Open 23 January 2026, 09:24 AM UPDATED\n\t\t\t\t\t\t23 January 2026, 13:46 PM SPORTS SHARE By AFP, Melbourne Belarus' Aryna Sabalenka celebrates winning a point against Austria's Anastasia Potapova in their women's singles match on day six of the Australian Open tennis tournament in Melbourne on January 23, 2026. Photo: AFP An emotional top seed Aryna Sabalenka survived a thorough examination from Anastasia Potapova before reaching the last 16 of the Australian Open on Friday to keep her on track for a third Melbourne title. The four-time Grand Slam champion needed 2hr 2min to see off the unseeded Russia-born Austrian Potapova 7-6 (7/4), 7-6 (9/7) as the temperatures climbed on Rod Laver Arena. For all latest news, follow The Daily Star's Google News channel. It set up a clash with fast-rising Canadian teenager Victoria Mboko for a place in the quarter-finals after the 17th seed battled past Danish 14th seed Clare Tauson in three sets. \"I was always on my the back foot, and to be honest, there's there's days where you just have to be there, just have to fight and try your best to put the ball back on that side,\" said Sabalenka, who was stunned in the final 12 months ago by Madison Keys. \"Even though emotionally I was all over the place, I was able to still fight for every point. It was such a fight, and I really enjoyed it.\" While safely through, Sabalenka will need to sharpen up to go all the way again, with 44 unforced errors, to Potapova's 25, a blot on the victory. Potapova had never gone beyond the third round in seven previous tournament appearances and never beaten a world number one. But she showed no signs of nerves against the Belarusian, who is chasing a third Melbourne crown in four years. Both players were broken in their first service games as they felt their way into a contest marked by heavy groundstrokes. Little separated them until the 12th game when Sabalenka turned up the heat to work four set points on Potapova's serve. But the gritty Potapova saved them all and held on to take the set to a tiebreak, where Sabalenka finally took charge. It sparked her to life and she crunched winners to break Potapova twice and open a 3-0 lead in the second set with the Austrian seemingly out of ideas. Sabalenka looked destined for a quick finish, but Potaova found a second wind and against the odds broke twice to level at 4-4 and frustrate the top seed. Sabalenka responded to break back, but lost focus serving for the match and let an unrelenting Potapova back in to send it to another tiebreak. Showing champion spirit, the Belarusian saved four set points before finally seeing off the Austrian to bank a testing win. ARYNA SABALENKA AUSTRALIAN OPEN SHARE Click to comment Comments Comments Policy Related News Emotional Sabalenka comes through test to make last 16 at Australian Open 23 January 2026, 09:24 AM Tennis 'Fearless' Sabalenka belatedly comes good to win Melbourne opener 18 January 2026, 17:45 PM Tennis Sabalenka into third straight Brisbane final ahead of Australian Open 10 January 2026, 11:21 AM Sabalenka impresses again in Australian Open warm-up, vows more to come 8 January 2026, 14:10 PM Women's sports Sabalenka says 'Battle of the Sexes' pays off after ruthless win 6 January 2026, 05:27 AM Tennis",
    "url": "https://www.thedailystar.net/sports/more-sports/tennis/news/emotional-sabalenka-comes-through-test-make-last-16-australian-open-4088401",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "Will Smith sued by tour violinist over alleged sexual harassment and wrongful dismissal",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture Will Smith sued by tour violinist over alleged sexual harassment and wrongful dismissal 2 January 2026, 08:59 AM UPDATED\n\t\t\t\t\t\t2 January 2026, 15:08 PM ENTERTAINMENT SHARE By Arts & Entertainment Desk Photo: Collected Actor and musician Will Smith has been sued by a former tour violinist who alleges sexual harassment, retaliation and wrongful termination during Smith's recent concert tour. According to a lawsuit filed on Wednesday and reviewed by Variety, musician Brian King Joseph has named Smith and Treyball Studios Management as defendants. The suit accuses Smith of engaging in \"predatory behaviour\" and claims he deliberately groomed Joseph for sexual exploitation while they were working together on the \"Based on a True Story: 2025 Tour\" earlier this year. For all latest news, follow The Daily Star's Google News channel. Joseph, who previously appeared on \"America's Got Talent\", alleges that Smith first hired him in November 2024 to perform at a show in San Diego. He was later invited to join Smith's 2025 tour and contribute to an upcoming album. As their professional relationship developed, the lawsuit claims Smith made personal remarks suggesting a uniquely close bond between them. The complaint details an incident during the tour's first leg in March 2025, when Joseph performed at a Las Vegas show. Hotel rooms had been arranged for band and crew members, and Joseph alleges that his bag — containing his room key — went missing for several hours before being returned by management. He claims that management were the only people with access to his room during that time. Read more Joe Keery’s ‘End of Beginning’ hits No 2 on global Spotify chart Later that night, Joseph says he returned to the room to find evidence that someone had entered without permission. Items allegedly left behind included wipes, a bottle of HIV medication bearing another person's name, and a handwritten note addressed to him, which he interpreted as a threat that an unknown individual would return to the room for sexual activity. Joseph reported the matter to hotel security, Smith's representatives and a non-emergency police line. The lawsuit further claims that days after the incident, a member of the management team reprimanded Joseph and accused him of fabricating the situation. Shortly afterwards, he was informed that his employment had been terminated. Joseph alleges that the dismissal caused significant emotional distress, including symptoms of post-traumatic stress disorder, as well as financial loss. He is seeking damages for sexual harassment, retaliation and wrongful termination, with compensation to be determined by a jury. A representative for Will Smith did not immediately respond to Variety's request for comment. WILL SMITH LAWSUIT SHARE Click to comment Comments Comments Policy Related News Will Smith expresses interest in Bollywood 14 January 2026, 15:23 PM TV & Film Will Smith sued by tour violinist over alleged sexual harassment and wrongful dismissal 2 January 2026, 08:59 AM Entertainment Will Smith confronts Oscar slap in new album release 29 March 2025, 05:00 AM Music Will Smith announces maiden album after two decades 15 March 2025, 13:33 PM Music Ranbir Kapoor’s star-studded selfie includes Bangladesh’s Mehazabien 9 December 2024, 05:38 AM TV & Film",
    "url": "https://www.thedailystar.net/entertainment/news/will-smith-sued-tour-violinist-over-alleged-sexual-harassment-and-wrongful",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "NCP leader Akhter Hossen files case in New York after egg attack",
    "body": "Editor's Pick Manifesto Expectations / Business community wants well-defined economic roadmap 24 January 2026, 02:33 AM Fish stocks collapse in the Bay of Bengal, fishermen at risk 24 January 2026, 00:45 AM Unheard Voices How Bangladesh lost leverage in cricket diplomacy 24 January 2026, 04:26 AM Business Plus / API Park: The pharmaceutical lifeline still out of reach 24 January 2026, 00:24 AM Business Is Bangladesh ready for ageing? 24 January 2026, 00:35 AM Big Picture NCP leader Akhter Hossen files case in New York after egg attack Says Awami League supporters targeted him at JFK Airport and later attempted to attack him at hotel 25 September 2025, 11:39 AM UPDATED\n\t\t\t\t\t\t25 September 2025, 17:42 PM NEWS SHARE By Star Online Report Screengrab shows Akhter walking away with, what appears to be, egg yolk dripping down his back as others try to shield him from attackers. Photo: Screenshot from video Akhter Hossen, member secretary of National Citizen Party (NCP), has filed a case following the egg attack on him in New York, allegedly by individuals affiliated with the Awami League. Akhter confirmed the information in a video message posted on his Facebook profile today. For all latest news, follow The Daily Star's Google News channel. The NCP leader said the case was lodged at a police station near the airport in New York around 11:00am (Bangladesh time) today. He also said the decision to file the case was made following consultations with New York police. The incident occurred at the John F Kennedy International Airport on Monday (September 22), when NCP leaders Akhter and Dr Tasnim Jara reached the United States to attend the United Nations General Assembly (UNGA). He said, \"After the attack at the airport, Awami terrorists came to our hotel lobby with the intention of attacking us again. At that time, NCP leaders and activists, along with our well-wishers in the US, resisted them and informed the police.\" \"We have filed the case against those who attacked us and attempted to kill us,\" he added. Hossen said that those involved in the attack are linked to a political organisation accused of committing genocide and crimes against humanity in Bangladesh. \"We will take legal action against Awami terrorists wherever they are -- inside the country or abroad. We believe that the crimes of Awami terrorists can be settled legally. Awami League will not get the opportunity to bring its terrorists back to Bangladesh,\" he said. SHARE Click to comment Comments Comments Policy",
    "url": "https://www.thedailystar.net/news/bangladesh/news/ncp-leader-akhter-hossen-files-case-new-york-after-egg-attack-3994536",
    "date": "2026-01-24",
    "language": "en"
  },
  {
    "title": "Life & Living | The Daily Star",
    "body": "Copyright: Any unauthorized use or reproduction of The Daily Star content for commercial purposesis strictly prohibited and constitutes copyright infringement liable to legal action. Copyright: Any unauthorized use or reproduction of The Daily Star content for commercial purposesis strictly prohibited and constitutes copyright infringement liable to legal action.",
    "url": "https://www.thedailystar.net/life-living",
    "date": "2026-01-24",
    "language": "en"
  }
]